---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeStirrupTieAttachment
source: html/5b557a04-b06c-893d-dabf-c0e18d64fc42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeStirrupTieAttachment Property

"Stirrup/Tie Attachment"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeStirrupTieAttachment { get; }
```